MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/Microchip.PIC32MX_DFP.pdsc
         <device Dname="PIC32MX775F512H">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MX775F512H.atdf"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="105"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x80000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="bootconfig" rw="" size="0x2ff0" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="kseg1_data_mem" rw="" size="0x10000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph1" rw="" size="0x800" start="0x1f80f000" type="" address-space="base"/>
                  <at:memory exec="" name="periph2" rw="" size="0x7000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph3" rw="" size="0x1000" start="0x1f889000" type="" address-space="base"/>
                  <at:memory exec="" name="periph4" rw="" size="0x2000" start="0x1f88b000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MX775F512H.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MX775F512H" title="Device page for PIC32MX775F512H"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MX775F512H" title="Datasheet"/>
         </device>
         <device Dname="PIC32MX775F512L">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MX775F512L.atdf"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="105"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x80000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="bootconfig" rw="" size="0x2ff0" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="kseg1_data_mem" rw="" size="0x10000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph1" rw="" size="0x800" start="0x1f80f000" type="" address-space="base"/>
                  <at:memory exec="" name="periph2" rw="" size="0x7000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph3" rw="" size="0x1000" start="0x1f889000" type="" address-space="base"/>
                  <at:memory exec="" name="periph4" rw="" size="0x2000" start="0x1f88b000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MX775F512L.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MX775F512L" title="Device page for PIC32MX775F512L"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MX775F512L" title="Datasheet"/>
         </device>
         <device Dname="PIC32MX154F128D">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MX154F128D.atdf"/>
                  <at:variant ordercode="" vccmin="2.5" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="" vccmin="2.5" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x20000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="bootconfig" rw="" size="0x2ff0" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="kseg1_data_mem" rw="" size="0x8000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph1" rw="" size="0x1000" start="0x1f80f000" type="" address-space="base"/>
                  <at:memory exec="" name="periph2" rw="" size="0x6000" start="0x1f881000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MX154F128D.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MX154F128D" title="Device page for PIC32MX154F128D"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MX154F128D" title="Datasheet"/>
         </device>
         <device Dname="PIC32MX154F128B">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MX154F128B.atdf"/>
                  <at:variant ordercode="" vccmin="2.5" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="" vccmin="2.5" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x20000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="bootconfig" rw="" size="0x2ff0" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="kseg1_data_mem" rw="" size="0x8000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph1" rw="" size="0x1000" start="0x1f80f000" type="" address-space="base"/>
                  <at:memory exec="" name="periph2" rw="" size="0x6000" start="0x1f881000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MX154F128B.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MX154F128B" title="Device page for PIC32MX154F128B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MX154F128B" title="Datasheet"/>
         </device>
         <device Dname="PIC32MX350F256L">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MX350F256L.atdf"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="" vccmin="2.3" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x40000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="bootconfig" rw="" size="0x2ff0" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="kseg1_data_mem" rw="" size="0x10000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph2" rw="" size="0x7000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph1" rw="" size="0xd00" start="0x1f80f000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MX350F256L.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MX350F256L" title="Device page for PIC32MX350F256L"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MX350F256L" title="Datasheet"/>
         </device>
